BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/oscilloscope.h
              // ESP32 S3 board: https://docs.espressif.com/projects/esp-idf/en/v4.4/esp32s3/api-reference/peripherals/adc.html
              switch (sharedMemory->gpio1) {
                  // ADC1
                  case  1: sharedMemory->adcchannel1 = ADC1_CHANNEL_0; break;
                  case  2: sharedMemory->adcchannel1 = ADC1_CHANNEL_1; break;
                  case  3: sharedMemory->adcchannel1 = ADC1_CHANNEL_2; break;
                  case  4: sharedMemory->adcchannel1 = ADC1_CHANNEL_3; break;
                  case  5: sharedMemory->adcchannel1 = ADC1_CHANNEL_4; break;
                  case  6: sharedMemory->adcchannel1 = ADC1_CHANNEL_5; break;
                  case  7: sharedMemory->adcchannel1 = ADC1_CHANNEL_6; break;
                  case  8: sharedMemory->adcchannel1 = ADC1_CHANNEL_7; break;
                  case  9: sharedMemory->adcchannel1 = ADC1_CHANNEL_8; break;
                  case 10: sharedMemory->adcchannel1 = ADC1_CHANNEL_9; break;
                  // ADC2 (GPIOs 11, 12, 13, 14, 15, 16, 17, 18, 19, 20), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSck->sendString (cstring ("[oscilloscope] can't analogRead GPIO ") + cstring (sharedMemory->gpio1) + "."); // send error also to javascript client
                            free (sharedMemory);
                            return;
              }
              switch (sharedMemory->gpio2) {
                  // ADC1
                  case  1: sharedMemory->adcchannel2 = ADC1_CHANNEL_0; break;
                  case  2: sharedMemory->adcchannel2 = ADC1_CHANNEL_1; break;
                  case  3: sharedMemory->adcchannel2 = ADC1_CHANNEL_2; break;
                  case  4: sharedMemory->adcchannel2 = ADC1_CHANNEL_3; break;
                  case  5: sharedMemory->adcchannel2 = ADC1_CHANNEL_4; break;
                  case  6: sharedMemory->adcchannel2 = ADC1_CHANNEL_5; break;
                  case  7: sharedMemory->adcchannel2 = ADC1_CHANNEL_6; break;
                  case  8: sharedMemory->adcchannel2 = ADC1_CHANNEL_7; break;
                  case  9: sharedMemory->adcchannel2 = ADC1_CHANNEL_8; break;
                  case 10: sharedMemory->adcchannel2 = ADC1_CHANNEL_9; break;
                  // not used
                  case 255: break;
                  // ADC2 (GPIOs 11, 12, 13, 14, 15, 16, 17, 18, 19, 20), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSck->sendString (cstring ("[oscilloscope] can't analogRead GPIO ") + cstring (sharedMemory->gpio2) + "."); // send error also to javascript client
                            free (sharedMemory);
                            return;
              }

          #elif CONFIG_IDF_TARGET_ESP32C3
              __oscilloscope_h_debug__ ("MCU ESP32C3 pinout");

              // ESP32 C3 board: https://docs.espressif.com/projects/esp-idf/en/latest/esp32c3/hw-reference/esp32c3/user-guide-devkitm-1.html
              switch (sharedMemory->gpio1) {
                  // ADC1
                  case  0: sharedMemory->adcchannel1 = ADC1_CHANNEL_0; break;
                  case  1: sharedMemory->adcchannel1 = ADC1_CHANNEL_1; break;
                  case  2: sharedMemory->adcchannel1 = ADC1_CHANNEL_2; break;
                  case  3: sharedMemory->adcchannel1 = ADC1_CHANNEL_3; break;
                  case  4: sharedMemory->adcchannel1 = ADC1_CHANNEL_4; break;
                  // ADC2 (GPIO 5), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSck->sendString (cstring ("[oscilloscope] can't analogRead GPIO ") + cstring (sharedMemory->gpio1) + "."); // send error also to javascript client
                            free (sharedMemory);
                            return;
              }
              switch (sharedMemory->gpio2) {
                  // ADC1
                  case  0: sharedMemory->adcchannel2 = ADC1_CHANNEL_0; break;
                  case  1: sharedMemory->adcchannel2 = ADC1_CHANNEL_1; break;
                  case  2: sharedMemory->adcchannel2 = ADC1_CHANNEL_2; break;
                  case  3: sharedMemory->adcchannel2 = ADC1_CHANNEL_3; break;
                  case  4: sharedMemory->adcchannel2 = ADC1_CHANNEL_4; break;
                  // not used
                  case 255: break;
                  // ADC2 (GPIO 5), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSck->sendString (cstring ("[oscilloscope] can't analogRead GPIO ") + cstring (sharedMemory->gpio2) + "."); // send error also to javascript client
                            free (sharedMemory);
                            return;
              }

          // #elif CONFIG_IDF_TARGET_ESP32C6

          // #elif CONFIG_IDF_TARGET_ESP32H2
            
          #else
              #error "Your board (CONFIG_IDF_TARGET) is not supported by oscilloscope.h"
          #endif

      }
      
      // parse 2nd part
      if (!cmdPart2) {
        #ifdef __DMESG__
            dmesgQueue << "[oscilloscope] oscilloscope protocol syntax error.";
        #endif
        webSck->sendString ("[oscilloscope] oscilloscope protocol syntax error."); // send error also to javascript client
        free (sharedMemory);    
        return;
      }
      if (sscanf (cmdPart2, "every %i %2s screen width = %lu %2s", &sharedMemory->samplingTime, sharedMemory->samplingTimeUnit, &sharedMemory->screenWidthTime, sharedMemory->screenWidthTimeUnit) != 4) {
        #ifdef __DMESG__
            dmesgQueue << "[oscilloscope] oscilloscope protocol syntax error.";
        #endif
        webSck->sendString ("[oscilloscope] oscilloscope protocol syntax error."); // send error also to javascript client
        free (sharedMemory);
        return;
      }
          
      // parse 3rd part
      if (cmdPart3) { 
        switch (sscanf (cmdPart3, "set %8s slope trigger to %i set %8s slope trigger to %i", posNeg1, &treshold1, posNeg2, &treshold2)) {
          case 0: // no trigger
                  break;
          case 4: // two triggers
                  if (!strcmp (posNeg2, "positive")) {
                    sharedMemory->positiveTrigger = true;
                    sharedMemory->positiveTriggerTreshold = treshold2;
                  }
                  if (!strcmp (posNeg2, "negative")) {
                    sharedMemory->negativeTrigger = true;
                    sharedMemory->negativeTriggerTreshold = treshold2;
                  }    
                  // don't break, continue to the next case
          case 2: // one trigger
                  if (!strcmp (posNeg1, "positive")) {
                    sharedMemory->positiveTrigger = true;
                    sharedMemory->positiveTriggerTreshold = treshold1;
                  }
                  if (!strcmp (posNeg1, "negative")) {
                    sharedMemory->negativeTrigger = true;
                    sharedMemory->negativeTriggerTreshold = treshold1;
                  }
                  break;
          default:
                  #ifdef __DMESG__
                      dmesgQueue << "[oscilloscope] oscilloscope protocol syntax error.";
                  #endif
                  webSck->sendString ("[oscilloscope] oscilloscope protocol syntax error."); // send error also to javascript client
                  free (sharedMemory);
                  return;
        }
      }

      // check the values and calculate derived values
      if (!(!strcmp (sharedMemory->readType, "analog") || !strcmp (sharedMemory->readType, "digital"))) {
        #ifdef __DMESG__
            dmesgQueue << "[oscilloscope] wrong readType. Read type can only be analog or digital.";
        #endif
        webSck->sendString ("[oscilloscope] wrong readType. Read type can only be analog or digital."); // send error also to javascript client
        free (sharedMemory);
        return;
      }
      if (sharedMemory->gpio1 < 0 || sharedMemory->gpio2 < 0) {
        #ifdef __DMESG__
            dmesgQueue << "[oscilloscope] invalid GPIO.";
        #endif
        webSck->sendString ("[oscilloscope] invalid GPIO."); // send error also to javascript client
        free (sharedMemory);
        return; 
      }
      if (!(sharedMemory->samplingTime >= 1 && sharedMemory->samplingTime <= 25000)) {
        #ifdef __DMESG__
            dmesgQueue << "[oscilloscope] invalid sampling time. Sampling time must be between 1 and 25000.";
        #endif
        webSck->sendString ("[oscilloscope] invalid sampling time. Sampling time must be between 1 and 25000."); // send error also to javascript client
        free (sharedMemory);
        return;
      }
      if (strcmp (sharedMemory->samplingTimeUnit, "ms") && strcmp (sharedMemory->samplingTimeUnit, "us")) {
        #ifdef __DMESG__
            dmesgQueue << "[oscilloscope] wrong samplingTimeUnit. Sampling time unit can only be ms or us.";
        #endif
        webSck->sendString ("[oscilloscope] wrong samplingTimeUnit. Sampling time unit can only be ms or us."); // send error also to javascript client
        free (sharedMemory);
        return;
      }

      if (strcmp (sharedMemory->screenWidthTimeUnit, sharedMemory->samplingTimeUnit)) {
        #ifdef __DMESG__
            dmesgQueue << "[oscilloscope] screenWidthTimeUnit must be the same as samplingTimeUnit.";
        #endif        
        webSck->sendString ("[oscilloscope] screenWidthTimeUnit must be the same as samplingTimeUnit."); // send error also to javascript client
        free (sharedMemory);
        return;
      }

      if (sharedMemory->positiveTrigger) {
        if (sharedMemory->positiveTriggerTreshold > 0 && sharedMemory->positiveTriggerTreshold <= (strcmp (sharedMemory->readType, "analog") ? 1 : 4095)) {
          ;// Serial.printf ("[oscilloscope] positive slope trigger treshold = %i\n", sharedMemory->positiveTriggerTreshold);
        } else {
          #ifdef __DMESG__
              dmesgQueue << "[oscilloscope] invalid positive slope trigger treshold (according to other settings).";
          #endif
          webSck->sendString ("[oscilloscope] invalid positive slope trigger treshold (according to other settings)."); // send error also to javascript client
          free (sharedMemory);
          return;
        }
      }
      if (sharedMemory->negativeTrigger) {
        if (sharedMemory->negativeTriggerTreshold >= 0 && sharedMemory->negativeTriggerTreshold < (strcmp (sharedMemory->readType, "analog") ? 1 : 4095)) {
          ;//Serial.printf ("[oscilloscope] negative slope trigger treshold = %i\n", sharedMemory->negativeTriggerTreshold);
        } else {
          #ifdef __DMESG__
              dmesgQueue << "[oscilloscope] invalid negative slope trigger treshold (according to other settings).";
          #endif
          webSck->sendString ("[oscilloscope] invalid negative slope trigger treshold (according to other settings)."); // send error also to javascript client
          free (sharedMemory);
          return;
        }
      }

      // choose the corect oscReader
      void (*oscReader) (void *sharedMemory);
      if (strcmp (sharedMemory->readType, "analog")) {
          oscReader = oscReader_digital; // us sampling interval, 1-2 signals, digital reader
      } else {
          oscReader = oscReader_analog; // us sampling interval, 1-2 signals, analog reader
          #ifdef USE_I2S_INTERFACE
            if (sharedMemory->gpio2 > 39 && sharedMemory->samplingTime <= 1000) // 1 signal only, sampling time is short enough
                oscReader = oscReader_analog_1_signal_i2s; // us sampling interval, 1 signal, (fast, DMA) I2S analog reader
          #endif
      }
      if (!strcmp (sharedMemory->samplingTimeUnit, "ms")) {
          oscReader = oscReader_millis; // ms sampling intervl, 1-2 signals, digital or analog reader with 'sample at a time' or 'screen at a time' options
      }

      sharedMemory->oscReaderState = INITIAL;

      BaseType_t taskCreated = xTaskCreate (oscReader, "oscReader", 4 * 1024, (void *) sharedMemory, OSCILLOSCOPE_READER_PRIORITY, NULL);
      if (pdPASS != taskCreated) {
            #ifdef __DMESG__
                dmesgQueue << "[oscilloscope] could not start oscReader";
            #endif
            webSck->sendString ("[oscilloscope] could not start oscReader."); // send error also to javascript client
      } else {

                // send oscReader START signal and wait until STARTED
                sharedMemory->oscReaderState = START; 
                while (sharedMemory->oscReaderState == START) delay (1); 

        // start oscilloscope sender in this thread

        oscSender ((void *) sharedMemory); 
        // stop reader - we can not simply vTaskDelete (oscReaderHandle) since this could happen in the middle of analogRead which would leave its internal semaphore locked

                // send oscReader STOP signal
                sharedMemory->oscReaderState = STOP; 

                // wait until oscReader STOPPED or error
                while (sharedMemory->oscReaderState != STOPPED) delay (1); 
      }

      free (sharedMemory);
      return;
    }

#endif